/*
       编写顺序               执行顺序
select     1        字段列表＇＇＇   4
from       2        表名列表＇＇＇   1
where      3        条件列表＇＇＇   2
group by   4        分组字段列表＇   3
having     5        分组后条件列表  (3)
order by   6        排序字段列表＇   5
limit      7        分页参数＇＇＇   6

   ┌─────────────────────────────────────────────────────┐
   │                 ┌──────────┬──────────┐             │
   ↑         ①      ↑          ↓          ↓             ↓
select ... from ... where ... group by ... having ... order by ... limit ...
   ↑        ↓        ↑           ↓                       ↓          ↑
   │        └────────┘           │                       └──────────┘
   └─────────────────────────────┘

distinct在select后
*/
